<?
//Описание ошибок

if (!MODULE_SYS) die("Файл может работать только как модуль!");

class printErrors{
  static function show($error){
    switch ($error){
      case "1":return 'Ошибка! невозможно подгрузить данный модуль!';break;
      case "2":return 'Невозможно зарегистрировать пользователя!';break;
      case "3":return 'Некорректный логин!';break;
      case "4":return 'Некорректный пароль!';break;
      case "5":return 'Некорректный E-mail!';break;
      case "6":return 'Неверный код!';break;
      case "7":return 'Некорректно заполнено поле "Фамилия"!';break;
      case "8":return 'Некорректно заполнено поле "Имя"!';break;
      case "9":return 'Некорректно заполнено поле "Город"!';break;
      case "10":return 'Некорректно заполнено поле "Адрес"!';break;
      case "11":return 'Некорректно заполнено поле "Телефон (контактный)"!';break;
      case "12":return 'Некорректно заполнено поле "Телефон (домашний)"!';break;
      case "13":return 'Данный логин уже используется на сайте!';break;
      case "14":return 'Неправильный логин/пароль!';break;
      case "15":return 'Ваш аккаунт блокирован. Для выяснения причин свяжитесь с администратором.';break;
      case "16":return 'Данные E-mail уже используется на сайте.';break;
      case "17":return 'Указанный логин/e-mail не найден в БД.';break;
      case "18":return 'На ваш E-mail был выслан новый пароль.';break;
      case "19":return 'Указанная Вами категория статей не найдена в БД.';break;
      case "20":return 'Публикации не найдены.';break;
      case "21":return 'Указанная статья не найдена в БД.';break;
      case "22":return 'Необходимо заполнить все обязательные поля формы! Они помечены звездочкой!';break;
      case "23":return 'На текущий момент заявок нет.';break;
      case "24":return 'Ваша анкета обновлена.';break;
      case "25":return 'Неверный текущий пароль.';break;
      case "26":return 'Пароль был успешно изменен.';break;
      case "27":return 'E-mail был успешно изменен.';break;
      case "28":return '<span style="color:red">Машина не числится в базе данных.</span>';break;
      case "29":return '<span style="color:red">Дату данной марки проверить нельзя.</span>';break;
      case "30":return 'Лот не найден.';break;
      case "31":return 'Невозможно посчитать стоимость машины автоматически. Попробуйте это сделать вручную в разделе "Расчет стоимости".';break;
      case "32":return 'У данного лота не графических изображений, перевод аукционного листа невозможен.';break;
      case "33":return 'Не удалось автоматически определить аукционный лист данного лота. Возможно он отсутствует. Если он присутствует, то Вам придется сделать запрос на перевод в ручном режиме.';break;
      case "34":return 'Заявку на перевод аукционного листа подать не удалось. Возможно технические проблемы. Обратитесь к администратору сайта.';break;
      case "35":return 'Заявка не найдена.';break;
      case "36":return 'Только зарегистрированные пользователи могут подавать заявку на перевод аукционного листа.';break;
      case "37":return 'У Вас недостаточно средств для выполнения данного действия.';break;
      case "38":return 'Заявка не найдена в БД.';break;
      case "39":return 'Не удалось закачать выбранный файл. Попробуйте снова. Если ошибка повторится, свяжитесь с администратором.';break;
      case "40":return 'Файл должен быть формата PNG, JPEG или GIF.';break;
      case "41":return 'Заявка на перевод листа успешно добавлена.';break;
      case "42":return 'История пуста.';break;
      case "43":return 'Избранное пусто.';break;
      case "44":return 'Избранное доступно только для зарегистрированных пользователей.';break;
      case "45":return 'Возникла ошибка при добавлении в избранное.';break;
      case "46":return 'Данный лот уже есть в Вашем избранном.';break;
      case "47":return 'Данный лот успешно добавлен в Ваше избранное.';break;
      case "48":return 'Новость не найдена.';break;
      case "49":return 'Раздела не существует.';break;
      default:return 'Неизвестная ошибка.';break;
    }
  }
}
?>